Revit 2024 API
CylindricalHelix.Height Property
 Height of the cylindrical helix.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Height { get; }
Visual Basic
Public ReadOnly Property Height As Double
	Get
Visual C++
public:
property double Height {
	double get ();
}
Remarks
 It is the length of the span of the helix along the axis direction. The height is defined only if the helix is bounded. That is, its start and end angles (parameters) are specified.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  Height is not defined for unbounded helix.
See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace